#+LaTeX_HEADER: \usepackage{amsmath,url,subcaption,comment,booktabs}
#+LaTeX_HEADER: \usepackage[round-precision=4,round-mode=figures,scientific-notation=true]{siunitx}
#+LaTeX_HEADER: \usepackage[super]{nth}
#+LaTeX_HEADER: \newcommand{\mytilde}{\raise.17ex\hbox{$\scriptstyle\mathtt{\sim}$}}

#+TITLE: Regression Analysis Fall 2012
#+AUTHOR: Trevor Murphy
#+EMAIL: trevor.m.murphy+vee@gmail.com

#+OPTIONS: num:nil toc:nil tasks:nil

#+BEGIN_SRC latex :noweb yes
  \begin{abstract}
    We find that the citation density of Wikipedia articles, measured as
    the number of unique citations divided by the article word count,
    may decrease very slightly with the length of the
    article. $\hat{\beta} \approx
    \num[round-precision=1]{<<linreg-beta()>>}$ in the linear
    regression, but heteroscedasticity casts significant doubt on our
    significance testing.
  \end{abstract}
#+END_SRC

** Data Description

The downloaded dump from Wikimedia came in a compressed format that expanded to
40 gigabytes of XML data, which included identifying elements and full text on
over 13 million articles.  The author created a simple program in the popular
Python[fn:3] programming langauge to parse these articles down to records of
word and citation counts.  At the same time, the program removed \mytilde 3
million articles that belonged to the `Wikipedia' namespace, i.e. supported the
internal functioning of Wikipedia and were of no interest to the present
analysis.

With 10 million parsed and filtered article records in hand, the author applied
a second filtering step to suit the analysis.  Terse redirect pages and long
disambiguation lists (as well as other common features of Wikipedia that have no
need for citations) comprised a majority of the records.  As these articles had
zero citation frequency by design, they did not fit the assumptions of our
chosen (logistic) model.

To work around this problem, \emph{all} sampled articles with zero citations
were filtered from the data set, leaving 2.5 million for further analysis.  This
step invariably threw out many legitimate articles.  However, since we lacked
the sophistication to appropriately define ``legitimate'' zero-citation
articles, we contented ourselves to study only articles of non-zero citation
density.  Of the 2.5 million, the author drew a random sample of approximately
2,500.  The author's programs and data sets should have been distributed with
this report; if not, please see the [[Appendix]].  A few of the sampled data records
appear in Table\nbsp\ref{tab:sample-data}.

#+NAME: sample-data-latex
#+BEGIN_SRC latex :noweb yes
  \begin{table}[p]
    \caption{Examples of Sampled Article Data}
    \makebox[\textwidth][c]{
      <<booktabs(table=sample-data-table, align="cccc")>>
    }
    \label{tab:sample-data}
  \end{table}
#+END_SRC

#+RESULTS[ee8df0772b34929d7a63f0316a5104d3bc1a477d]: sample-data-latex
#+BEGIN_LaTeX
\begin{table}[p]
  \caption{Examples of Sampled Article Data}
  \makebox[\textwidth][c]{
    
    \begin{tabular}{cccc}
    \toprule
    Article ID & Article Title & Word Count $X$ & Link (Cite) Count $Y$ \\
    \midrule
    1146 & Assembly line & 3733 & 17 \\
    3395 & Gautama Buddha & 9343 & 63 \\
     & ... &  &  \\
    38083580 & Midland Railway War Memorial, Derby & 671 & 8 \\
    38087721 & Hugh Gallacher (footballer born 1870) & 267 & 1 \\
    \bottomrule
    \end{tabular}
    
  }
  \label{tab:sample-data}
\end{table}
#+END_LaTeX

** Analysis with Python

The author used Python to perform the regression analysis.  Like the users of R,
the Python community has created an extensive body of packages to support
specialized work - SciPy[fn:4] provided the statistical routines for the
following.  In addition, matplotlib[fn:5] provided the graphical plotting tools
for the images used.

Basic summary statistics for both variables of interest were simple to calculate
using the =stats= package from SciPy.  For illustrative purposes we present the
code here with a description immediately following.  (Note that the
=<<hyphenated-words>>= lines are not part of Python but rather are pseudocode to
gloss over the steps necessary to import our raw data and load the word and
citation counts, $X$ and $Y$, into the array variable =data=).

#+BEGIN_SRC python :noweb no :eval never
  <<declare-imports>>
  <<get-raw-data-sample-array>>
#+END_SRC
#+BEGIN_SRC python :noweb yes :eval never
  <<from-numpy-array-make-summary-stats>>
#+END_SRC

Python functions can return the results of multiple calculations at once, and
these results can be assigned to multiple variables by writing the targets
sequentially on one line, separated by commas.  In the first line above the
=describe= function returns the sample size, a pair of minimum and maximum
values, the mean, variance, skewness, and the kurtosis of the data set.
Variables with suggestive names have been created and assigned these values.

Python can also succinctly express iterated code execution with what are termed
"comprehensions".  In Python an ordered list is written with square brackets (as
in =[1, 2, 3, 4]=) and placing a clause like =f(i) for i in
a_sequence_of_values= within square brackets creates a list of the expected
results by the process of "list comprehension".  In the second line above, the
=scoreatpercentile= function (a/k/a quantile function) is evaluated on the data
to calculate the quartiles, and the results are packaged in a list.  The
elements of the list are then assigned to multiple comma-separated values.

Finally, variables can themselves hold multiple values if it is convenient.
While not obvious in the code above, the =describe= and =scoreatpercentile=
functions have actually returned tuples of values in every case.  That is, the
variable =Min= above contains the tuple =(min(x), min(y))=, and likewise for
=Max=, =Mean=, etc.  The first and second values of these tuples can be
referenced with the =[0]= and =[1]= suffix notation, respectively, and new
tuples can be created by enclosing computations in parentheses.  Thus the third
line creates a =StdDev= tuple to match the others.

The results of this code are presented in Table\nbsp\ref{tab:summary-stats}.
Notice the extreme right-skew of both variables - even though 75\% of articles
contain fewer than 1074 words and fewer than 6 citations, the sampled upper
bounds on word length and citation count are so high that the sample means are
approximately equal to the \nth{75} percentile.

#+NAME: summary-stats-latex
#+BEGIN_SRC latex
  \begin{table}[hp]
    \centering
    \caption{Summary Statistics for Sampled Article Data}
    <<booktabs(table=summary-stats-table, align="lcccccccc")>>
    \label{tab:summary-stats}
  \end{table}
#+END_SRC

#+RESULTS[1fce5a83fdd2d1a2a60311e420c13ea9a9cfd6ad]: summary-stats-latex
#+BEGIN_LaTeX
\begin{table}[htb]
  \centering
  \caption{Summary Statistics for Sampled Article Data}
  
  \begin{tabular}{lcccccccc}
  \toprule
  Var & N & Min & $Q_1$ & Median & Mean & $Q_3$ & Max & StdDev \\
  \midrule
  $X$ & 2472 & 30 & 272 & 556 & 1070 & 1158 & 28844 & 1844 \\
  $Y$ & 2472 & 1 & 1 & 3 & 7 & 7 & 476 & 19 \\
  \bottomrule
  \end{tabular}
  
  \label{tab:summary-stats}
\end{table}
#+END_LaTeX

*** Calculations (exec)
:PROPERTIES:
:noweb: yes
:END:

#+NAME: make-linreg-stats-table
#+HEADER: :colnames '("Slope" "Intercept" "R Value" "P Value" "StdErr" "BetaMult")
#+BEGIN_SRC python :return linreg_stats
  <<declare-imports>>
  <<get-raw-data-sample-array>>
  <<process-numpy-array-to-X-Y-Lt>>
  <<linear-regress-X-Lt-with-scipy>>
  
  Xbar = sum(X) / len(X)
  beta_mult = math.sqrt(1 / sum((X - Xbar)**2))
  linreg_stats = [[slope, intercept, r_value, p_value, stderr, beta_mult]]
#+END_SRC

#+TBLNAME: linreg-stats-table
#+RESULTS[a6916885706bbb4acb3634aa347a9dca4c8ef418]: make-linreg-stats-table
|                  Slope |          Intercept |              R Value |                P Value |                StdErr |             BetaMult |
|------------------------+--------------------+----------------------+------------------------+-----------------------+----------------------|
| -4.972082441886146e-05 | -5.127786951398692 | -0.11272293394467421 | 1.9142310253560464e-08 | 8.818621606730039e-06 | 1.09072780800565e-05 |

#+NAME: linreg-alpha
#+HEADER: :var linreg-stats=linreg-stats-table
#+BEGIN_SRC emacs-lisp
(nth 1 (caddr linreg-stats))
#+END_SRC

#+RESULTS[2ddac0ba5abb37fffbf3dfcf9ea2f9261428b61b]: linreg-alpha
: -5.127786951398692

#+NAME: linreg-beta
#+HEADER: :var linreg-stats=linreg-stats-table
#+BEGIN_SRC emacs-lisp
(nth 0 (caddr linreg-stats))
#+END_SRC

#+RESULTS[9eff510b2d1790e1a26f7c55d90f92a3e54b4faf]: linreg-beta
: -4.972082441886146e-05

#+NAME: linreg-p
#+HEADER: :var linreg-stats=linreg-stats-table
#+BEGIN_SRC emacs-lisp
(nth 3 (caddr linreg-stats))
#+END_SRC

#+RESULTS[d396010ce513c9edfe8e5a63bef5b1a012fdd2d8]: linreg-p
: 1.9142310253560464e-08

#+NAME: linreg-stderr
#+HEADER: :var linreg-stats=linreg-stats-table
#+BEGIN_SRC emacs-lisp
(nth 4 (caddr linreg-stats))
#+END_SRC

#+RESULTS[1772a83e0879ba9c9cd93fa7efb17d3b9d3e6410]: linreg-stderr
: 8.818621606730039e-06

#+NAME: linreg-beta-mult
#+HEADER: :var linreg-stats=linreg-stats-table
#+BEGIN_SRC emacs-lisp
(nth 5 (caddr linreg-stats))
#+END_SRC

#+RESULTS[75a47b6d9c75f8e884391b01e84b89195d27e058]: linreg-beta-mult
: 1.09072780800565e-05

#+NAME: linreg-beta-stderr
#+HEADER: :var linreg-stats=linreg-stats-table
#+BEGIN_SRC emacs-lisp
  (*
   (string-to-number (nth 4 (caddr linreg-stats)))
   (string-to-number (nth 4 (caddr linreg-stats))))
#+END_SRC

#+RESULTS[05aa34bad1adfdaf6c965ba07c77e84a47ab59ec]: linreg-beta-stderr
: 7.776808704268589e-11

